Revit 2027 API
FabricArea.IsValidMajorLapSplice Method
 Identifies if the specified value is valid for use as a major lap splice.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidMajorLapSplice(
	double majorLapSplice
)
Public Function IsValidMajorLapSplice (
	majorLapSplice As Double
) As Boolean
public:
bool IsValidMajorLapSplice(
	double majorLapSplice
)
member IsValidMajorLapSplice :
        majorLapSplice : float -> bool
Parameters
majorLapSplice Double
 The major lap splice value.
Return Value
Boolean
 True if the value is valid, false if the value is invalid.
Remarks
 The major lap splice should be less than or equal to half of the overall length.
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace